## Final Report
    
<img src="sba_logo.png" alt="SBA Logo" title="SBA Logo" width="300" height="100" align="right"/>

# <p style="font-size:40px ; color:blue" align="center">Predicting SBA Loan Defaults</p> <sub>By Kaniela Denis - 24 Jan 2022</sub>

<hr style="border:2px solid blue"> </hr>

In [1]:
# import needed libraries
import pandas as pd
import numpy as np
import prepare

import warnings
warnings.filterwarnings("ignore")

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Agenda

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Executive Summary

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Overview

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Acquire

In [2]:
df = pd.read_csv('SBAnational.csv')
df.head()

,LoanNr_ChkDgt,Name,City,State,Zip,Bank,BankState,NAICS,ApprovalDate,ApprovalFY,...,RevLineCr,LowDoc,ChgOffDate,DisbursementDate,DisbursementGross,BalanceGross,MIS_Status,ChgOffPrinGr,GrAppv,SBA_Appv
0,1000014003,ABC HOBBYCRAFT,EVANSVILLE,IN,47711,FIFTH THIRD BANK,OH,451120,28-Feb-97,1997,...,N,Y,NaN,28-Feb-99,"$60,000.00",$0.00,P I F,$0.00,"$60,000.00","$48,000.00"
1,1000024006,LANDMARK BAR & GRILLE (THE),NEW PARIS,IN,46526,1ST SOURCE BANK,IN,722410,28-Feb-97,1997,...,N,Y,NaN,31-May-97,"$40,000.00",$0.00,P I F,$0.00,"$40,000.00","$32,000.00"
2,1000034009,"WHITLOCK DDS, TODD M.",BLOOMINGTON,IN,47401,GRANT COUNTY STATE BANK,IN,621210,28-Feb-97,1997,...,N,N,NaN,31-Dec-97,"$287,000.00",$0.00,P I F,$0.00,"$287,000.00","$215,250.00"
3,1000044001,"BIG BUCKS PAWN & JEWELRY, LLC",BROKEN ARROW,OK,74012,1ST NATL BK & TR CO OF BROKEN,OK,0,28-Feb-97,1997,...,N,Y,NaN,30-Jun-97,"$35,000.00",$0.00,P I F,$0.00,"$35,000.00","$28,000.00"
4,1000054004,"ANASTASIA CONFECTIONS, INC.",ORLANDO,FL,32801,FLORIDA BUS. DEVEL CORP,FL,0,28-Feb-97,1997,...,N,N,NaN,14-May-97,"$229,000.00",$0.00,P I F,$0.00,"$229,000.00","$229,000.00"

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Prepare

In [3]:
df = prepare.wrangle(df)
df.head()

,loan_id,name,city,state,zip,bank,bank_state,naics,appv_date,appv_fy,...,disbursement_gross,loan_status,default_amount,appv_loan_amount,sba_appv_amount,is_new,sba_percent,monthly_debt,jobs_count,is_default
0,1000014003,ABC HOBBYCRAFT,EVANSVILLE,IN,47711,FIFTH THIRD BANK,OH,451120,1997-02-28,1970-01-01 00:00:00.000001997,...,60000.0,paid,0.0,60000.0,48000.0,1,0.8,714.29,0,0
1,1000024006,LANDMARK BAR & GRILLE (THE),NEW PARIS,IN,46526,1ST SOURCE BANK,IN,722410,1997-02-28,1970-01-01 00:00:00.000001997,...,40000.0,paid,0.0,40000.0,32000.0,1,0.8,666.67,0,0
3,1000044001,"BIG BUCKS PAWN & JEWELRY, LLC",BROKEN ARROW,OK,74012,1ST NATL BK & TR CO OF BROKEN,OK,0,1997-02-28,1970-01-01 00:00:00.000001997,...,35000.0,paid,0.0,35000.0,28000.0,0,0.8,583.33,0,0
7,1000094005,WEAVER PRODUCTS,SUMMERFIELD,FL,34491,REGIONS BANK,AL,811118,1997-02-28,1970-01-01 00:00:00.000001997,...,45000.0,paid,0.0,45000.0,36000.0,1,0.8,535.71,0,0
9,1000124001,INTEXT BUILDING SYS LLC,GLASTONBURY,CT,6073,WEBSTER BANK NATL ASSOC,CT,0,1997-02-28,1970-01-01 00:00:00.000001997,...,70000.0,paid,0.0,70000.0,56000.0,1,0.8,833.33,0,0


<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Explore

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Model

<hr style="border:2px solid blue"> </hr>

# <font color = 'blue'> Conclusion

## Summary
- ???

## Recommendations
- ???

## Next Steps
- ???